# <기본연산자>

# 실행 단축키 C + Enter
a<-1
a

b<-2
b
a+b
a*b
a-b
a/b
b**2

a<-2
b<-3
a**3
a^2
b/a
b%/%a # 몫 
b%%a # 나머지

ifelse(a>=2,'2 이상','2 미만')
1 %in% 1:3 # TRUE 리턴 (존재 여부)
4 %in% 1:3 # FALSE 리턴
#----------------------------------
# < 벡터 >
v<-c(1,2,3,4,5)
v[1] # 인덱스는 1부터 시작하는 1-Base임.
v[2]
v[1:3] # 연속 슬라이싱 / 마지막 요소가 포함되어 슬라이싱됨.
#v[1,3] # 슬라이싱 안됨.
#v[1:2,3] # 행렬이 아니므로 이러한 방식으로 슬라이싱 안됨.

v[c(1,3,4)] # 비연속 슬라이싱
#-------------------------------------
seq(1,5,by=2) # seq(시작, 끝, 증가치)
seq(1,10,length=5) # 수열 5등분
1:5
c(1:5)
#--------------------------------------
rep(1:2,5) # 1에서 2까지 5묶음이 만들어짐.(반복)
unique(rep(1:2,5)) # unique() 반복 제거.
#---------------------------------------
is.vector(v) # TRUE
length(v) # 5
#---------------------------------------------------
"a" %in% c("a","b","c") # 매칭연산자
#[1] TRUE
" a " %in% c ( " a " , " b " , " c " )
#[1] TRUE
" d " %in% c ( " a " , " b " , " c " )
#[1] FALSE
#-----------------------------------------------------
v1<-c(1,2,3,4,5) # c요소를 줘서 벡터로 만들어준다.
v1<-seq(1,5) #[1] 1 2 3 4 5

v1[1] # 1 / R은 인덱스가 1부터 시작!!
v1[1:3] # [1] 1 2 3
v1[c(1:3)] # [1] 1 2 3
v1[c(1,3,7)] # [1]  1  3 NA(결측치) 

v1<-seq(1,10,2) #증감수 /[1] 1 3 5 7 9 /홀수가 나열됨.
v1<-seq(1,10,length=5) # 등분수/length=2 >>> 2등분해라 
# [1]  1.00  3.25  5.50  7.75 10.00 / 1~10까지 5등분하라

v1<-rep(1:2,5) # 1~2 수가 5쌍이 될때까지 반복 
# [1] 1 2 1 2 1 2 1 2 1 2
v1<-rep(1:2,length=5) # 총개수 
# [1] 1 2 1 2 1 / 1~2 범위까지의 수를 총 5개가 될때까지 반복.
#----------------------------------------------------------

v1<-c(1,2,3,4,5)
v2<-c(4,5,6,7,8)

v1+2 # [1] 3 4 5 6 7 / 각 요소별로 2가 각각 더해짐.
v1+v2 # [1]  5  7  9  11  13
union(v1,v2) # 합집합 /[1] 1 2 3 4 5 6 7 8 / 중복값은 단일값으로 됨.
#--------------------------------------------------------
t(v1)%*%v2 # 벡터간의 내적 / 100 = 4 + 10 + 18 + 28 + 40
v1*v2 # [1]  4 10 18 28 40 / 이걸 전부 합친게 내적 결과값
#--------------------------------------------------------
# 행렬 총개수는 nrow 배수가 되야함.
x<-matrix ( c (1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9) , nrow =3)
# 기본이 열방향으로 나열되는 배열이기에 이렇게됨
# 행방향(세로)
x<-matrix ( c (1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9) , ncol =3)
# 열방향(가로)
x<-matrix ( c (1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9) , nrow =3 , byrow = T )
# 행방향으로 원할시 (byrow = T)를 준다.

x [1:2 , ] # 1행부터 2행까지 모든열을 의미

x [ -3 , ] # 3행을 제외하고 모든 행과 열 / 위와 동일

x[1,2]

x[2,] # 2행의 모든 수.
x[,2] # 2열의 모든 수.

x[1:2,1:2] # 1부터 2행, 1부터 2열까지의 행렬.
# 행선택(필터링 인덱스), 열선택(셀렉팅(sql사용시 select에서 열선택시) 인덱스)

x<-matrix ( c (1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9) , nrow =3 , byrow = T )
#------------------------------------------------------------
d <- data.frame ( x = c (1 , 2 , 3 , 4 , 5) , y = c (2 , 4 , 6 , 8 , 10) )

d <- data.frame ( x = c (1 , 2 , 3 , 4 , 5) ,
                  y = c (2 , 4 , 6 , 8 , 10) ,
                  z = c ('M', 'F', 'M', 'F', 'M') )
d$v <- c (3 , 6 , 9 , 12 , 15) # 새로운열 추가시 "$"사용한다.
# "d"(DataFrame) + "$"(컬럼추가) + "v"(컬럼명)

d$x <-c(3,6,9,12,15)
d[1] # 기본인덱스는 열-인덱스
# x열 리턴함.
d[1,1] # 1행 1열
d[1,] # 1행의 모든열
d[c(1,2),2] # 1행과 2행의 2번열 요소
d[1:2,2]
d[c(1,3),c(2,4)]
 
str(d)

View(d) # 대문자 "V" 꼭 쓸것.
df <- data.frame()
df <- edit(df) # 편집창 / 팝업창 뜸.
head(df)
tail(df)
#--------------------------------------------------
sex <- factor ( " m " , c ( " m " , " f " ) )
sex
# factor >>> 카테고리 목록(level(목록을 의미))
# 변수명 m
# 레벨값 m f
x <- c("A","B","C","A","B","C") # 실벡터
g <- c("A","B","C") # 레벨 벡터
# g를 단순한 열-벡터가 아닌 factor로 변환
f <- factor(x,g)
#--------------------------------------------------
x <- list(name="foo", height=c(1,3,5))
x
list ( a = list ( val = c (1 , 2 , 3) ) , b = list ( val = c (1 , 2 , 3 , 4) ) )

x <- list ( name = " foo " , height = c (1 , 3 , 5) )
x$name # " foo "
x[[1]]

x$height # [1] 1 3 5
x[[2]]

#--------------------------------------------------
# 타입판별
class ( c (1 , 2) ) #[1] " numeric "

x<- c('1','2')
class(x) #[1] "character"

is.vector(x) # [1] TRUE
class(d) #[1] "data.frame"

as.numeric()

x <- c ( " m " , " f " )
as.factor ( x )
as.numeric ( as.factor ( x ) )

x<- c('1','2')
# 문자를 숫자로 변환
class(x) #[1] "character"
y=as.numeric(x)
class(y) #[1] "numeric"
#------------------------------------------
# 매칭 연산자 %in%
1 %in% y #[1] TRUE
#--------------------------------------------
# 대입 연산자 
a <- 1

a <<-1 # 잘안씀

a = 2 # 잘안쓰지만 되긴된다.
a # [1] 2
#--------------------------------------------
3 -> a # 역대입 가능.

3=a # 불가! 오류뜸.

3 ->> a # 역대입 가능/ 잘안씀.
#--------------------------------------------
3/2
3%/%2 # 몫을 구할때
3%%2 # 나머지를 구할때.

# 삼항 조건 연산자
ifelse(3>2,'크다','이하')
# print()는 1가지만 출력
print(1)
print(2)
print('결과=',1,2) # [1] "결과=" 만 출력됨.
cat('결과=',1,2) #결과= 1 2 / # 전부 출력됨.
# 여러개 출력시 cat() 사용한다.
cat('결과=',1,'\n',2)
# 형식 출력 
sprintf('결과=%d %0.1f %s',1,2.34,'A') #[1] "결과=1 2.3 A"




